Revit 2025 API
CeramicApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicApplication" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CeramicApplicationType
Public Enumeration CeramicApplicationType
public enum class CeramicApplicationType
type CeramicApplicationType
Members
Member name | Value | Description
HighGlossy | 0
Satin | 1
Matte | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace